[
    
        {
            
            "url": "/blog/2025/05/15/BlogDesignProcess3",

            
                
                    "image": "/Resources/KelexerLogo.svg",
                
            

            "date": "May 15, 2025",
            "tags": ["blog","website","tutorial"],

            "title": "Dynamic blog post filtering using Jekyll",
            "subtitle": "How I implemented a dynamic post fetching system for my blog",

            "excerpt": "In my last post in this 4 part series, I talked about how I conceptualized, designed, and implemented the UI for my blog page using various techniques and tools. This post, I will shift from the front end design of the blog page, and instead focus more on the backend code that makes the entire page function. Technically, you don’t need to use any sort of JavaScript to deploy a functioning blog ..."
        },
    
        {
            
            "url": "/blog/2025/05/02/BlogDesignProcess2",

            
                
                    "image": "/Resources/KelexerLogo.svg",
                
            

            "date": "May  2, 2025",
            "tags": ["blog","website","tutorial"],

            "title": "Designing the UI of my blog",
            "subtitle": "How I conceptualized, designed, and built the UI of my blog",

            "excerpt": "In my last blog post, I talked about how I used the finalized blog to expedite the post creation process by taking advantage of tools I created, and others such as Jekyll, GitHub Pages, and Obsidian. In this post, Ill delve deeper into the front end UI design process behind the blog, from conceptualizing the UI, to making a mock UI, to creating the HTML and CSS. In my opinion, the hardest part ..."
        },
    
        {
            
            "url": "/blog/2025/05/02/AboutAssembly",

            
                
                    "image": "/Resources/KelexerLogo.svg",
                
            

            "date": "May  2, 2025",
            "tags": ["assembly","coding","cybersecurity","selfteaching","writeup"],

            "title": "About Assembly",
            "subtitle": "My thoughts after self-teaching assembly and using it for cybersecurity",

            "excerpt": "I’ve spent the past 2 weeks self teaching NASM x86 Assembly (primarily on Linux), and I wanted to share my thoughts and experiences from what I’ve learned, and how I plan to apply and further my skills. Programming languages can be ranked on a sort of scale, from high level to low level. The “higher” level a language is, the closer the syntax to human readable language. Take python for example,..."
        },
    
        {
            
            "url": "/blog/2025/04/27/BlogDesignProcess1",

            
                
                    "image": "/Resources/KelexerLogo.svg",
                
            

            "date": "April 27, 2025",
            "tags": ["blog","website","tutorial"],

            "title": "Building a blog page using Jekyll",
            "subtitle": "How I create posts efficiently using Jekyll",

            "excerpt": "In my previous post, I mainly talked about the fact that the blog part of my website was live, which is cool, but I think what’s cooler is all the juicy software and code that went into making it (excluding the hair-loss). Therefore, through the course of multiple posts, I’ll dive deeper into the how and why thought process that I used to design the blog, from UI to code, to other important des..."
        },
    
        {
            
            "url": "/blog/2025/04/26/FirstPost",

            
                
                    "image": "/Resources/KelexerLogo.svg",
                
            

            "date": "April 26, 2025",
            "tags": ["blog","website"],

            "title": "First Post",
            "subtitle": "",

            "excerpt": "I was actually planning to get the blog part of my website done a couple months ago. However, my university decided to dump a small island worth of various assignment and thingamajigs, followed by immediately final exams. So unsurprisingly, I’ve been kind of busy since March 10, 2025 (Yes, it took 3 months, stop judging me). There actually used to be a portfolio page that would accompany the bl..."
        }
    
]
